{"darkmodetoggle-dark":"Sombre","darkmodetoggle-white":"Blanc","hero2D-aboutme":"À Propos","hero2D-description":"Bienvenue dans mon portfolio digital, où innovation et créativité convergent. Avec un sens aigu de l'esthétique, une passion pour le modelage 2D/3D et une maîtrise du code, mon portfolio vous offre une vitrine de projets professionnels diversifiés qui reflètent mon parcours vers la maîtrise du développement full-stack.\n","hero2D-header":"Créer des Expériences Digital, Façonner Demain","hero2D-viewwork":"Voir mon projects","navbar-about":"À propos","navbar-contact":"Contact","navbar-home":"Accueil","navbar-work":"Projet","project1-desc":"Viet Vibe Web est une plateforme sécurisée, basée sur les rôles, conçue pour simplifier la gestion des événements et des cours pour les communautés et les organisations à but non lucratif. Conçue avec une architecture full-stack moderne, la plateforme permet aux utilisateurs de s'inscrire, de se connecter et d'acheter des billets pour des événements ou des cours organisés, ou de consulter les dernières publications régulièrement publiées sur nos réseaux sociaux. Les administrateurs peuvent gérer les rôles, publier des événements, publier des mises à jour et suivre l'engagement via un tableau de bord dédié.","project1-subdesc":"Conçu comme une application Software-as-a-Service avec Next.js 15, Tailwind CSS, TypeScript, Prisma, Stripe et Framer Motion, Viet Vibe Web est conçu pour des performances et une évolutivité optimales pour les grandes communautés.","project1-title":"Viet Vibe Web – Gérez vos événements, partagez vos histoires, développez votre communauté","project2-desc":"3D Worlds est une série de projets intégrant des modèles 3D à des sites web pour créer des expériences numériques immersives et visuellement captivantes. Ce projet mettra en lumière l'importance des modèles 3D dans le développement web, permettant aux marques et aux créateurs de créer des expériences immersives et interactives pour leurs utilisateurs.","project2-subdesc":"Construit avec ReactJS/NextJS, TailwindCSS, Three.js, Framer Motion et Blenders, 3D Worlds offre une expérience de modélisation et de rendu 3D puissante et intuitive, permettant aux utilisateurs de s'immerger facilement dans différents mondes 3D.","project2-title":"Mondes 3D - Où la 2D et la 3D se rencontrent","project3-desc":"Namaste est une plateforme de classification des postures de yoga conçue pour faciliter les entraînements à domicile en fournissant un retour en temps réel sur la précision des postures. Grâce à la détection des postures et à l'apprentissage profond, l'application permet aux utilisateurs d'apprendre le yoga en toute sécurité, sans avoir recours à un professeur. Inspiré à l'origine par l'essor du fitness à domicile pendant la pandémie de COVID-19, cet outil vise à améliorer l'accessibilité et l'apprentissage des personnes pratiquant le yoga à distance.","project3-subdesc":"Conçue avec Python, TensorFlow, OpenPose et OpenCV, Namaste combine un pipeline de détection de poses avec un modèle de classification d'images (CNN et EfficientNet) pour classer 14 postures de yoga courantes et fournir un retour d'information basé sur la fiabilité du modèle. La plateforme utilise un modèle EfficientNet pré-entraîné pour une précision optimale et une interface utilisateur Streamlit épurée pour une expérience utilisateur intuitive.","project3-title":"Namaste – Classification des postures de yoga optimisée par l'apprentissage automatique","project4-desc":"NCRA AuthX est un système complet d'authentification et de gestion des utilisateurs conçu pour soutenir le réseau de radios communautaires du Canada. Conçu pour plus de 1 000 utilisateurs actifs, il améliore la sécurité et les performances pour les créateurs de contenu, les administrateurs de stations et les contributeurs partout au pays.","project4-subdesc":"Conçue avec PostgreSQL, NodeJS, ExpressJS et PassportJS, cette plateforme permet aux stations de radio un accès fluide basé sur les rôles et une gestion des données en temps réel. Avec une baisse de 10 % des tentatives d'accès non autorisées, NCRA AuthX est la plateforme de confiance pour une diffusion communautaire sécurisée.","project4-title":"NCRA AuthX – Expérience sécurisée pour la communauté radiophonique canadienne","work-checksite":"Consultez le site","work-header":"Mon Projets Sélectionné","workroom3D-header":"Mon Espace de Travail","workroom3D-viewlaptop":"Voir l'ordinateur"}