{"about-skill":"COMPÉTENCES","bio-desc":"Je suis Khai Hung, développeur Full-Stack et possède une expérience pratique dans le développement d'applications web dynamiques et réactives avec React, Next.js, TailwindCSS, Python et PostgreSQL. Je suis spécialisé dans l'intégration d'animations 2D et 3D dans des interfaces modernes pour créer des expériences utilisateur immersives et engageantes. Fort de solides bases en développement Full-Stack et d'un intérêt marqué pour les solutions basées sur l'IA, je cherche constamment à optimiser les performances et à améliorer l'interaction utilisateur. J'apprends vite et je m'adapte facilement et m'épanouis dans des environnements collaboratifs où l'innovation et l'amélioration continue sont valorisées.","bio-quote":"Connectons-nous et donnons vie à vos idées percutantes.","bio-title":"BIOGRAPHIE","contact-desc":"Que vous cherchiez à créer un site Web, à améliorer votre plateforme, à collaborer sur un projet ou à en savoir plus sur moi, je suis là pour parler.","contact-email":"E-mail","contact-emailholder":"Votre email","contact-message":"Message","contact-messageholder":"Partagez vos pensées ou vos messages","contact-name":"Nom","contact-nameholder":"Votre nom complet","contact-or":"Ou","contact-send":"Envoyer un message","contact-sendmessage":"Envoie-moi un message","contact-subject":"Sujet","contact-subjectholder":"Votre sujet","contact-title":"Parlons-en !","darkmodetoggle-dark":"Sombre","darkmodetoggle-white":"Blanc","experience-jobdesc1":"J'ai dirigé le développement Web, offrant une expertise dans les frameworks NextJS pour améliorer le site Web actuel.","experience-jobdesc2":"J'ai développé et maintenu l'intégration avec des API et des services tiers, garantissant un flux de données et une expérience utilisateur fluides.","experience-jobdesc3":"J'ai amélioré le site Web actuel et mis en œuvre des stratégies de référencement efficaces, augmentant le trafic des utilisateurs de 30 % en trois mois.","experience-joblocation1":"Clinique dentaire 3C","experience-jobtitle1":"Développeur Fullstack","experience-jobtitle2":"Développeur de logiciels","experience-jobtitle3":"Développeur Web","experience-title":"EXPÉRIENCE","hero2D-aboutme":"À Propos","hero2D-description":"Bienvenue dans mon portfolio digital, où innovation et créativité convergent. Avec un sens aigu de l'esthétique, une passion pour le modelage 2D/3D et une maîtrise du code, mon portfolio vous offre une vitrine de projets professionnels diversifiés qui reflètent mon parcours vers la maîtrise du développement full-stack.\n","hero2D-header":"Créer des Expériences Digital, Façonner Demain","hero2D-viewwork":"Voir mon projects","myCat":"Mon chat","myCatDescription":"Le meilleur chat du monde (seulement quand il dort 😉).","myCertificateDescription":"Veuillez cliquer sur l'image pour voir mon certificat.","myLove":"Mon amour","myLoveDescription":"Un certain couple adorable (ma fille et moi).","navbar-about":"À propos","navbar-contact":"Contact","navbar-home":"Accueil","navbar-work":"Projet","present":"Présent","project1-desc":"Viet Vibe Web est une plateforme sécurisée, basée sur les rôles, conçue pour simplifier la gestion des événements et des cours pour les communautés et les organisations à but non lucratif. Conçue avec une architecture full-stack moderne, la plateforme permet aux utilisateurs de s'inscrire, de se connecter et d'acheter des billets pour des événements ou des cours organisés, ou de consulter les dernières publications régulièrement publiées sur nos réseaux sociaux. Les administrateurs peuvent gérer les rôles, publier des événements, publier des mises à jour, suivre l'engagement via un tableau de bord dédié, consulter les paiements des utilisateurs et envoyer des e-mails/SMS aux participants de nos cours.","project1-imageDescription1":"Interface utilisateur de la page d'accueil moderne","project1-imageDescription2":"Cartes d'événements conviviales et entièrement personnalisables pour les administrateurs","project1-imageDescription3":"Page de profil robuste affichant l'historique des paiements et des abonnements de l'utilisateur depuis Stripe","project1-imageDescription4":"Composants d'événements réutilisables avec éditeur de texte personnalisé et prix pour abonnement/cours complet","project1-subdesc":"Conçue comme une application SaaS (Software-as-a-Service) avec Next.js 15, Tailwind CSS, TypeScript, Prisma, Stripe et Framer Motion, Viet Vibe Web offre des performances et une évolutivité optimales pour les grandes communautés. Les données de paiement des utilisateurs issues de Stripe sont traitées en toute sécurité avec une latence minimale grâce à un webhook spécialisé.","project1-title":"Viet Vibe Web – Gérez vos événements, partagez vos histoires, développez notre communauté","project2-desc":"3D Worlds est une série de projets intégrant des modèles 3D à des sites web pour créer des expériences numériques immersives et visuellement captivantes. Ce projet mettra en lumière l'importance des modèles 3D dans le développement web, permettant aux marques et aux créateurs de créer des expériences immersives et interactives pour leurs utilisateurs.","project2-imageDescription1":"Modèle 3D de mon portfolio, présentant une version réduite de la section « travail ». Vous pouvez le consulter sur la page d'accueil.","project2-imageDescription2":"Exemple de page de contact avec une animation 3D","project2-imageDescription3":"Cartes de projet avec effets de survol 3D pour plus d'interactivité","project2-imageDescription4":"Modèle miniature 3D Blender de mon espace de travail","project2-subdesc":"Construit avec ReactJS/NextJS, TailwindCSS, Three.js, Framer Motion et Blenders, 3D Worlds offre une expérience de modélisation et de rendu 3D puissante et intuitive, permettant aux utilisateurs de s'immerger facilement dans différents mondes 3D.","project2-title":"Mondes 3D - Où la 2D et la 3D se rencontrent","project3-desc":"Namaste est une plateforme de classification des postures de yoga conçue pour faciliter les entraînements à domicile en fournissant un retour en temps réel sur la précision des postures. Grâce à la détection des postures et à l'apprentissage profond, l'application permet aux utilisateurs d'apprendre le yoga en toute sécurité, sans avoir recours à un professeur. Inspiré à l'origine par l'essor du fitness à domicile pendant la pandémie de COVID-19, cet outil vise à améliorer l'accessibilité et l'apprentissage des personnes pratiquant le yoga à distance.","project3-imageDescription1":"Résultat d'une détection de pose correcte de la pose Guerrier 2","project3-imageDescription2":"Il y aura un exemple d'image pour guider les utilisateurs","project3-imageDescription3":"Un autre exemple en temps réel d'une détection de pose correcte de Tree Pose","project3-imageDescription4":"Le modèle peut détecter quelle est la pose correcte même lorsque l'utilisateur choisit une pose incorrecte","project3-subdesc":"Conçue avec Python, TensorFlow, OpenPose et OpenCV, Namaste combine un pipeline de détection de poses avec un modèle de classification d'images (CNN et EfficientNet) pour classer 14 postures de yoga courantes et fournir un retour d'information basé sur la fiabilité du modèle. La plateforme utilise un modèle EfficientNet pré-entraîné pour une précision optimale et une interface utilisateur Streamlit épurée pour une expérience utilisateur intuitive.","project3-title":"Namaste – Classification des postures de yoga optimisée par l'apprentissage automatique","project4-desc":"NCRA AuthX est un système d'authentification et de gestion des utilisateurs conçu pour soutenir le réseau de radio communautaire canadien. Conçu pour plus de 1 000 utilisateurs actifs, il améliore la sécurité et les performances pour les créateurs de contenu, les administrateurs de stations et les contributeurs partout au pays.","project4-imageDescription1":"Page d'accueil interactive du NCRA","project4-imageDescription2":"Site Web permettant aux membres de gérer leur profil et leur abonnement","project4-subdesc":"Conçue avec PostgreSQL, NodeJS, ExpressJS et PassportJS, cette plateforme permet aux stations de radio un accès fluide basé sur les rôles et une gestion des données en temps réel. Avec une baisse de 10 % des tentatives d'accès non autorisées, NCRA AuthX est la plateforme de confiance pour une diffusion communautaire sécurisée.","project4-title":"NCRA AuthX – Expérience sécurisée pour la communauté radiophonique canadienne","project5-desc":"Le bot de résumé automatisé est un bot Discord conçu pour fournir des résumés de conversations basés sur l'IA toutes les heures. Il s'appuie sur le modèle ChatGPT pour générer des résumés concis et informatifs des discussions en cours, permettant aux membres du serveur de se tenir informés plus facilement sans avoir à lire de longues conversations. Le bot inclut également une commande amusante pour générer de jolies images, issues de son référentiel forké d'origine. Hébergé sans serveur via Cloudflare Workers, il garantit évolutivité et rentabilité, tout en garantissant une interaction fluide et en temps réel grâce à l'API Discord Interactions.","project5-imageDescription1":"Un exemple de résumé","project5-subdesc":"La pile technologique comprend l'API Discord Interactions, Cloudflare Workers, ChatGPT, l'API Reddit, NodeJS et JavaScript. Parmi les fonctionnalités clés, citons la synthèse des conversations pilotée par l'IA, la génération d'images, l'intégration de l'API avec Reddit et le déploiement sans serveur via Cloudflare Workers, démontrant ainsi la maîtrise de l'intégration de l'IA, des interactions en temps réel et de l'architecture sans serveur.","project5-title":"Résumé automatisé des messages Discord bot propulsé par ChatGPT","work-checksite":"Consultez le site","work-header":"Mon Projets Sélectionné","workroom3D-header":"Mon Espace de Travail","workroom3D-helpers":"Outils d'aide\n","workroom3D-showLightRays":"Afficher les rayons lumineux","workroom3D-toggleDarkMode":"Activer le mode sombre","workroom3D-viewlaptop":"Voir l'ordinateur","workroom3D-zoom":"Zoom"}