{
  "about-skill": "KỸ NĂNG",
  "bio-desc": "Tôi là Khai Hung, một lập trình viên Full-Stack với kinh nghiệm thực tế trong việc phát triển các web và ứng dụng responsive bằng React, Next.js, TailwindCSS, Python và PostgreSQL. Tôi chuyên về việc tích hợp hoạt ảnh 2D và 3D vào các giao diện để xây dựng trải nghiệm hấp dẫn và lôi cuốn cho người dùng . \n\nVới nền tảng vững chắc trong phát triển full-stack và sự quan tâm mạnh mẽ đến các giải pháp hỗ trợ AI, tôi liên tục tìm cách tối ưu hóa hiệu suất và nâng cao tương tác của người dùng. Tôi là người học hỏi và thích nghi nhanh, và sẽ phát triển mạnh trong môi trường cộng tác nơi sự đổi mới và cải tiến liên tục được coi trọng.",
  "bio-quote": "Hãy kết nối và biến những ý tưởng tuyệt vời của bạn thành hiện thực.",
  "bio-title": "TIỂU SỬ",
  "contact-desc": "Dù bạn đang muốn xây dựng một trang web, cải thiện nền tảng, hợp tác trong một dự án hay chỉ muốn biết thêm về tôi, tôi luôn sẵn sàng trò chuyện.",
  "contact-email": "Email",
  "contact-emailholder": "Email của bạn",
  "contact-message": "Tin nhắn",
  "contact-messageholder": "Hãy chia sẻ suy nghĩ của bạn",
  "contact-name": "Tên",
  "contact-nameholder": "Họ tên đầy đủ của bạn",
  "contact-or": "Hoặc",
  "contact-send": "Gửi Tin Nhắn",
  "contact-sendmessage": "Gửi cho tôi một tin nhắn",
  "contact-subject": "Chủ đề",
  "contact-subjectholder": "Chủ đề",
  "contact-title": "Hãy bắt đầu câu chuyện!",
  "darkmodetoggle-dark": "Tối",
  "darkmodetoggle-white": "Sáng",
  "experience-jobdesc1": "Tôi phụ trách phát triển web, cung cấp chuyên môn về các khuôn khổ NextJS để nâng cao trang web hiện tại.",
  "experience-jobdesc2": "Tôi đã phát triển và duy trì tích hợp với các API và dịch vụ của bên thứ 3, đảm bảo luồng dữ liệu và trải nghiệm của người dùng liền mạch và mượt mà.",
  "experience-jobdesc3": "Tôi cải thiện trang web và triển khai các chiến lược SEO hiệu quả, giúp tăng lượng truy cập của người dùng lên 30% trong vòng ba tháng.",
  "experience-joblocation1": "Phòng khám nha khoa 3C",
  "experience-jobtitle1": "Lập trình viên Fullstack",
  "experience-jobtitle2": "Nhà phát triển phần mềm",
  "experience-jobtitle3": "Nhà phát triển web",
  "experience-title": "KINH NGHIỆM",
  "hero2D-aboutme": "Về Tôi",
  "hero2D-description": "Chào mừng đến với portfolio của tôi, nơi mà những sự đổi mới và sáng tạo quy tụ. Với con mắt tinh tường về thẩm mỹ, cùng với niềm đam mê tạo hình 2D/3D và sự thành thạo về lập trình, portfolio của tôi sẽ cung cấp cho bạn một bộ sưu tập đa dạng các dự án chuyên nghiệp phản ánh hành trình của tôi trở nên thành thạo hơn trong việc trở thành lập trình viên full-stack.\n",
  "hero2D-header": "Kiến Tạo Trải Nghiệm Số, Định Hình Tương Lai",
  "hero2D-viewwork": "Xem Dự Án",
  "myCat": "Bé mèo của tôi",
  "myCatDescription": "Con mèo tuyệt vời nhất thế giới (chỉ khi ngủ 😉).",
  "myCertificateDescription": "Vui lòng nhấp vào hình ảnh để xem chứng chỉ.",
  "myLove": "Tình yêu của tôi",
  "myLoveDescription": "Một cặp đôi đáng yêu hết sẩy (tôi và bạn gái tôi).",
  "navbar-about": "Giới thiệu",
  "navbar-contact": "Liên hệ",
  "navbar-home": "Trang chủ",
  "navbar-work": "Dự án",
  "present": "Hiện tại",
  "project1-desc": "Viet Vibe Web là một nền tảng dựa trên vai trò được thiết kế để tối ưu hóa việc quản lý sự kiện và lớp học cho cộng đồng và các tổ chức phi lợi nhuận. Được xây dựng với những framework full-stack hiện đại, nền tảng này cho phép người dùng đăng ký, đăng nhập và mua vé cho các sự kiện hoặc lớp học, hoặc tương tác với các bài đăng mới nhất liên tục được lấy từ phương tiện truyền thông xã hội của chúng tôi. Người quản trị có thể quản lý vai trò, xuất bản sự kiện, đăng cập nhật, theo dõi mức độ tương tác thông qua bảng điều khiển chuyên dụng, kiểm tra thanh toán của người dùng và gửi email/tin nhắn văn bản cho những người tham gia lớp học của chúng tôi.",
  "project1-imageDescription1": "Giao diện trang chủ hiện đại",
  "project1-imageDescription2": "Các thẻ sự kiện thân thiện với người dùng có thể tùy chỉnh hoàn toàn bởi admin",
  "project1-imageDescription3": "Trang hồ sơ năng động hiển thị lịch sử thanh toán và đăng ký của người dùng từ Stripe",
  "project1-imageDescription4": "Các thành phần event có thể tái sử dụng với trình soạn thảo văn bản tùy chỉnh và giá tùy chỉnh cho đăng ký/khóa học đầy đủ",
  "project1-subdesc": "Được xây dựng như một ứng dụng Phần mềm dưới dạng Dịch vụ với Next.js 15, Tailwind CSS, TypeScript, Prisma, Stripe và Framer Motion, Viet Vibe Web được thiết kế để có hiệu suất và khả năng mở rộng tối ưu cho các cộng đồng lớn. Đối với dữ liệu thanh toán của người dùng từ Stripe, một webhook chuyên dụng được tạo ra để xử lý những dữ liệu này một cách an toàn với độ trễ thấp nhất.",
  "project1-title": "Viet Vibe Web – Quản lý sự kiện, chia sẻ câu chuyện, phát triển cộng đồng",
  "project2-desc": "3D Worlds là chuỗi dự án tích hợp mô hình 3D vào trang web để xây dựng trải nghiệm kỹ thuật số hấp dẫn và trực quan. Dự án này sẽ nêu bật tầm quan trọng của mô hình 3D trong phát triển web, cho phép các thương hiệu và nhà sáng tạo tạo ra trải nghiệm tương tác và hấp dẫn cho người dùng của họ.",
  "project2-imageDescription1": "Mô hình 3D của danh mục đầu tư của tôi, trong đó hiển thị phiên bản nhỏ của phần công việc. Bạn có thể kiểm tra trên trang chủ",
  "project2-imageDescription2": "Trang liên hệ với hình ảnh động 3D",
  "project2-imageDescription3": "Thẻ dự án với hiệu ứng di chuột 3D để tăng tính tương tác",
  "project2-imageDescription4": "Mô hình thu nhỏ 3D của Blender về không gian làm việc của tôi",
  "project2-imageDescription5": "Mô phỏng hiệu ứng nền 3D của Vanta.js",
  "project2-subdesc": "Được xây dựng bằng ReactJS/NextJS, TailwindCSS, Three.js, Framer Motion và Blenders, 3D Worlds cung cấp trải nghiệm dựng hình 3D mạnh mẽ và trực quan, cho phép người dùng đắm mình vào nhiều thế giới 3D khác nhau một cách dễ dàng.",
  "project2-title": "Thế giới 3D - Nơi 2D và 3D gặp nhau",
  "project3-desc": "Namaste là một app phân loại tư thế yoga được thiết kế để hỗ trợ các bài tập tại nhà bằng cách cung cấp phản hồi theo thời gian thực về độ chính xác của tư thế. Tận dụng khả năng phát hiện tư thế và học sâu, ứng dụng giúp người dùng học yoga an toàn mà không cần đến người hướng dẫn trực tiếp. Lấy cảm hứng từ sự gia tăng của thể dục tại nhà trong đại dịch COVID-19, công cụ này nhằm mục đích cải thiện khả năng tiếp cận và học tập cho những cá nhân tập yoga từ xa.",
  "project3-imageDescription1": "Kết quả tư thế chính xác của tư thế Chiến binh 2",
  "project3-imageDescription2": "Hình ảnh mẫu để hướng dẫn người dùng",
  "project3-imageDescription3": "Một ví dụ thời gian thực khác về việc phát hiện tư thế Tree Pose chính xác",
  "project3-imageDescription4": "Mô hình có thể phát hiện tư thế nào là đúng ngay cả khi người dùng chọn tư thế không đúng",
  "project3-subdesc": "Được xây dựng bằng Python, TensorFlow, OpenPose và OpenCV, Namaste kết hợp với một mô hình phân loại hình ảnh (CNN và EfficientNet) để phân loại 14 tư thế yoga phổ biến và cung cấp phản hồi dựa trên độ tin cậy của mô hình. Nền tảng này sử dụng một mô hình EfficientNet được đào tạo trước để có độ chính xác vượt trội và một giao diện người dùng Streamlit tinh gọn để mang lại trải nghiệm người dùng tốt nhất.",
  "project3-title": "Namaste – Phân loại tư thế Yoga được hỗ trợ bởi Machine Learning",
  "project4-desc": "NCRA AuthX là hệ thống quản lý người dùng và xác thực toàn diện được xây dựng để hỗ trợ mạng lưới phát thanh cộng đồng của Canada. Được thiết kế cho hơn 1000 người dùng đang hoạt động, hệ thống này tăng cường bảo mật và hiệu suất cho người sáng tạo nội dung, quản trị viên đài phát thanh và cộng tác viên trên khắp cả nước.",
  "project4-imageDescription1": "Trang chủ mang tính tương tác",
  "project4-imageDescription2": "Trang web dành cho thành viên quản lý hồ sơ và đăng ký của họ",
  "project4-subdesc": "Được xây dựng với PostgreSQL, NodeJS, ExpressJS và PassportJS, nền tảng này cung cấp khả năng truy cập dựa trên vai trò liền mạch và xử lý dữ liệu thời gian thực cho các đài phát thanh. Với mức giảm 10% các nỗ lực truy cập trái phép, NCRA AuthX là trụ cột đáng tin cậy đằng sau cộng đồng điều hành radio.",
  "project4-title": "NCRA AuthX – Trải nghiệm an toàn cho cộng đồng phát thanh radio ở Canada",
  "project5-desc": "Automated Summary Bot là một bot Discord được thiết kế để cung cấp các bản tóm tắt cuộc trò chuyện bằng AI. Nó tận dụng mô hình ChatGPT để tạo ra các bản tóm tắt ngắn gọn nhưng đầy đủ thông tin về các cuộc thảo luận đang diễn ra, giúp các thành viên máy chủ dễ dàng cập nhật mà không cần đọc qua các cuộc trò chuyện dài dòng. Bot này cũng bao gồm một lệnh thú vị để tạo ra các hình ảnh dễ thương, bắt nguồn từ kho lưu trữ phân nhánh ban đầu của nó. Nó được lưu trữ không cần máy chủ bằng Cloudflare Workers, đảm bảo khả năng mở rộng và hiệu quả về chi phí trong khi vẫn duy trì tương tác mượt mà, theo thời gian thực thông qua API Discord Interactions.",
  "project5-imageDescription1": "Bản tóm tắt mẫu",
  "project5-subdesc": "Bộ công nghệ bao gồm Discord Interactions API, Cloudflare Workers, ChatGPT, Reddit API, NodeJS và JavaScript. Các tính năng chính bao gồm tóm tắt cuộc trò chuyện do AI điều khiển, tạo hình ảnh, tích hợp API với Reddit và triển khai không cần máy chủ thông qua Cloudflare Workers, thể hiện trình độ thành thạo trong tích hợp AI, tương tác thời gian thực và kiến trúc không cần máy chủ.",
  "project5-title": "Tóm tắt tin nhắn tự động Bot Discord được hỗ trợ bởi ChatGPT",
  "project6-desc": "Một ứng dụng web tập trung vào thiết kế UI đơn giản và thanh lịch. Tuy nhiên, tính năng mạnh mẽ nằm ở công cụ giống Excel mà tôi đã tạo ra với nhiều tính năng nâng cao, chẳng hạn như thêm người dùng hàng loạt, chỉnh sửa ô bằng cách nhấp vào chúng, hoàn tác các giá trị trước đó, thay đổi kích thước cột, v.v. Nó cũng đi kèm với thời gian truy vấn phản hồi gần như bằng không! (Để đạt được điều đó, tôi phải code mà không cần dựa vào bất kỳ thư viện nào.) \n\nĐược xây dựng bằng ReactJS và Express.js và lưu trữ bằng AWS và Render (tất cả đều là các tầng miễn phí), ứng dụng cung cấp giải pháp giúp giảm lượng thời gian dành cho giấy tờ tại các phòng khám truyền thống, có thể chuyển sang nền tảng dễ sử dụng và tập trung mà không mất bất kỳ chi phí nào.",
  "project6-subdesc": "Được xây dựng bằng ReactJS và Express.js và lưu trữ bằng AWS và Render (tất cả đều là các tầng miễn phí), ứng dụng cung cấp giải pháp giúp giảm lượng thời gian dành cho giấy tờ tại các phòng khám truyền thống, có thể chuyển sang nền tảng tập trung dễ sử dụng và không mất bất kỳ chi phí nào.",
  "project6-imageDescription1": "Thiết kế giao diện người dùng đơn giản",
  "project6-imageDescription2": "Công cụ quản lí người dùng giống với Excel và có thể tùy chỉnh đa dạng",
  "project6-title": "Ứng dụng Mỹ Đức Dental - Đơn giản hóa việc quản lý người dùng",
  "work-checksite": "Check trang web/Github",
  "work-header": "Các Tác Phẩm Nổi Bật",
  "workroom3D-header": "Góc Làm Việc",
  "workroom3D-helpers": "Hỗ trợ",
  "workroom3D-showLightRays": "Hiển thị tia sáng",
  "workroom3D-toggleDarkMode": "Chuyển đổi sáng/tối",
  "workroom3D-viewlaptop": "Tới Laptop",
  "workroom3D-zoom": "Độ zoom",
  "project7-desc": "Một backend API cho ứng dụng My Duc Dental, được xây dựng bằng Express.js và lưu trữ bằng Render. API này quản lý xác thực người dùng, quản lý dữ liệu và tích hợp với frontend để cung cấp trải nghiệm người dùng mượt mà.",
  "project7-subdesc": "Được xây dựng bằng Express.js và lưu trữ bằng Render, API này quản lý xác thực người dùng, quản lý dữ liệu và tích hợp với frontend để cung cấp trải nghiệm người dùng mượt mà.",
  "project7-title": "Backend My Duc Dental - API an toàn và mở rộng",
  "project7-imageDescription1": "API quản lý xác thực người dùng, quản lý dữ liệu và tích hợp với frontend để cung cấp trải nghiệm người dùng mượt mà."
}
